testCases/mixingChannel_fgmFluid_RAS/0.orig/alphat
FoamFile { format ascii; class volScalarField; object alphat; }
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet  { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    upperWall { type symmetry; }
    lowerWall { type symmetry; }
    frontAndBack { type empty; }
}
