testCases/mixingChannel_fgmFluid_RAS/0.orig/k
FoamFile { format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.00375;
boundaryField
{
    inlet  { type fixedValue; value uniform 0.00375; }
    outlet { type inletOutlet; inletValue uniform 0.00375; value uniform 0.00375; }
    upperWall { type symmetry; }
    lowerWall { type symmetry; }
    frontAndBack { type empty; }
}
