testCases/mixingChannel_fgmFluid_RAS/0.orig/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 1e7;
boundaryField
{
    inlet { type zeroGradient; }
    outlet { type fixedValue; value uniform 1e7; }
    upperWall { type symmetry; }
    lowerWall { type symmetry; }
    frontAndBack { type empty; }
}
