testCases/mixingChannel_fgmFluid_RAS/constant/fgmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| FGM (FPV + beta-PDF) lookup table  --  04_build_fgm_table.py                |
| source flamelets: flamelets_synth.npz                                    |
| P = 1e+07 Pa                                                       |
| axes: Z~ (nZ=51), gZ=Zvar/(Z~(1-Z~)) (nGz=11), C~ (nC=41)                |
| flat C-order: idx = (iZ*nGz + iGz)*nC + iC                                  |
| tabulated: sourcePV (omega_C), T, Y_<species> (for SRK+Chung/Ely thermo)   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fgmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nZ      51;
nGz     11;
nC      41;

Z
(
    0.00000000e+00
    2.00000000e-02
    4.00000000e-02
    6.00000000e-02
    8.00000000e-02
    1.00000000e-01
    1.20000000e-01
    1.40000000e-01
    1.60000000e-01
    1.80000000e-01
    2.00000000e-01
    2.20000000e-01
    2.40000000e-01
    2.60000000e-01
    2.80000000e-01
    3.00000000e-01
    3.20000000e-01
    3.40000000e-01
    3.60000000e-01
    3.80000000e-01
    4.00000000e-01
    4.20000000e-01
    4.40000000e-01
    4.60000000e-01
    4.80000000e-01
    5.00000000e-01
    5.20000000e-01
    5.40000000e-01
    5.60000000e-01
    5.80000000e-01
    6.00000000e-01
    6.20000000e-01
    6.40000000e-01
    6.60000000e-01
    6.80000000e-01
    7.00000000e-01
    7.20000000e-01
    7.40000000e-01
    7.60000000e-01
    7.80000000e-01
    8.00000000e-01
    8.20000000e-01
    8.40000000e-01
    8.60000000e-01
    8.80000000e-01
    9.00000000e-01
    9.20000000e-01
    9.40000000e-01
    9.60000000e-01
    9.80000000e-01
    1.00000000e+00
);

gZ
(
    0.00000000e+00
    9.00000000e-02
    1.80000000e-01
    2.70000000e-01
    3.60000000e-01
    4.50000000e-01
    5.40000000e-01
    6.30000000e-01
    7.20000000e-01
    8.10000000e-01
    9.00000000e-01
);

C
(
    0.00000000e+00
    7.49934076e-03
    1.49986815e-02
    2.24980223e-02
    2.99973630e-02
    3.74967038e-02
    4.49960446e-02
    5.24953853e-02
    5.99947261e-02
    6.74940669e-02
    7.49934076e-02
    8.24927484e-02
    8.99920891e-02
    9.74914299e-02
    1.04990771e-01
    1.12490111e-01
    1.19989452e-01
    1.27488793e-01
    1.34988134e-01
    1.42487474e-01
    1.49986815e-01
    1.57486156e-01
    1.64985497e-01
    1.72484838e-01
    1.79984178e-01
    1.87483519e-01
    1.94982860e-01
    2.02482201e-01
    2.09981541e-01
    2.17480882e-01
    2.24980223e-01
    2.32479564e-01
    2.39978904e-01
    2.47478245e-01
    2.54977586e-01
    2.62476927e-01
    2.69976267e-01
    2.77475608e-01
    2.84974949e-01
    2.92474290e-01
    2.99973630e-01
);

sourcePV
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

T
(
    1.20000000e+02
    1.20000000e+02
    1.54228337e+02
    2.47901792e+02
    2.47901792e+02
    3.88680511e+02
    3.88680511e+02
    5.65689547e+02
    5.65689547e+02
    7.69394434e+02
    7.69394434e+02
    7.69394434e+02
    9.91484749e+02
    9.91484749e+02
    9.91484749e+02
    1.22476525e+03
    1.22476525e+03
    1.22476525e+03
    1.46305422e+03
    1.46305422e+03
    1.46305422e+03
    1.70108873e+03
    1.70108873e+03
    1.70108873e+03
    1.93443630e+03
    1.93443630e+03
    1.93443630e+03
    1.93443630e+03
    2.15941288e+03
    2.15941288e+03
    2.15941288e+03
    2.37300656e+03
    2.37300656e+03
    2.37300656e+03
    2.57280696e+03
    2.57280696e+03
    2.57280696e+03
    2.57280696e+03
    2.75693975e+03
    2.75693975e+03
    2.75693975e+03
    1.20000000e+02
    1.20000000e+02
    1.54228337e+02
    2.47901792e+02
    2.47901792e+02
    3.88680511e+02
    3.88680511e+02
    5.65689547e+02
    5.65689547e+02
    7.69394434e+02
    7.69394434e+02
    7.69394434e+02
    9.91484749e+02
    9.91484749e+02
    9.91484749e+02
    1.22476525e+03
    1.22476525e+03
    1.22476525e+03
    1.46305422e+03
    1.46305422e+03
    1.46305422e+03
    1.70108873e+03
    1.70108873e+03
    1.70108873e+03
    1.93443630e+03
    1.93443630e+03
    1.93443630e+03
    1.93443630e+03
    2.15941288e+03
    2.15941288e+03
    2.15941288e+03
    2.37300656e+03
    2.37300656e+03
    2.37300656e+03
    2.57280696e+03
    2.57280696e+03
    2.57280696e+03
    2.57280696e+03
    2.75693975e+03
    2.75693975e+03
    2.75693975e+03
    1.20000000e+02
    1.20000000e+02
    1.54228337e+02
    2.47901792e+02
    2.47901792e+02
    3.88680511e+02
    3.88680511e+02
    5.65689547e+02
    5.65689547e+02
    7.69394434e+02
    7.69394434e+02
    7.69394434e+02
    9.91484749e+02
    9.91484749e+02
    9.91484749e+02
    1.22476525e+03
    1.22476525e+03
...
);

species ( CO CO2 H2O KERO N2 O2 );

Y_CO
(
    0.00000000e+00
    0.00000000e+00
    2.95071872e-04
    1.10260165e-03
    1.10260165e-03
    2.31621130e-03
    2.31621130e-03
    3.84215127e-03
    3.84215127e-03
    5.59822788e-03
    5.59822788e-03
    5.59822788e-03
    7.51279956e-03
    7.51279956e-03
    7.51279956e-03
    9.52383834e-03
    9.52383834e-03
    9.52383834e-03
    1.15780537e-02
    1.15780537e-02
    1.15780537e-02
    1.36300753e-02
    1.36300753e-02
    1.36300753e-02
    1.56416923e-02
    1.56416923e-02
    1.56416923e-02
    1.56416923e-02
    1.75811455e-02
    1.75811455e-02
    1.75811455e-02
    1.94224703e-02
    1.94224703e-02
    1.94224703e-02
    2.11448876e-02
    2.11448876e-02
    2.11448876e-02
    2.11448876e-02
    2.27322392e-02
    2.27322392e-02
    2.27322392e-02
    0.00000000e+00
    0.00000000e+00
    2.95071872e-04
    1.10260165e-03
    1.10260165e-03
    2.31621130e-03
    2.31621130e-03
    3.84215127e-03
    3.84215127e-03
    5.59822788e-03
    5.59822788e-03
    5.59822788e-03
    7.51279956e-03
    7.51279956e-03
    7.51279956e-03
    9.52383834e-03
    9.52383834e-03
    9.52383834e-03
    1.15780537e-02
    1.15780537e-02
    1.15780537e-02
    1.36300753e-02
    1.36300753e-02
    1.36300753e-02
    1.56416923e-02
    1.56416923e-02
    1.56416923e-02
    1.56416923e-02
    1.75811455e-02
    1.75811455e-02
    1.75811455e-02
    1.94224703e-02
    1.94224703e-02
    1.94224703e-02
    2.11448876e-02
    2.11448876e-02
    2.11448876e-02
    2.11448876e-02
    2.27322392e-02
    2.27322392e-02
    2.27322392e-02
    0.00000000e+00
    0.00000000e+00
    2.95071872e-04
    1.10260165e-03
    1.10260165e-03
    2.31621130e-03
    2.31621130e-03
    3.84215127e-03
    3.84215127e-03
    5.59822788e-03
    5.59822788e-03
    5.59822788e-03
    7.51279956e-03
    7.51279956e-03
    7.51279956e-03
    9.52383834e-03
    9.52383834e-03
...
);

Y_CO2
(
    0.00000000e+00
    0.00000000e+00
    1.77043123e-03
    6.61560991e-03
    6.61560991e-03
    1.38972678e-02
    1.38972678e-02
    2.30529076e-02
    2.30529076e-02
    3.35893673e-02
    3.35893673e-02
    3.35893673e-02
    4.50767974e-02
    4.50767974e-02
    4.50767974e-02
    5.71430300e-02
    5.71430300e-02
    5.71430300e-02
    6.94683219e-02
    6.94683219e-02
    6.94683219e-02
    8.17804515e-02
    8.17804515e-02
    8.17804515e-02
    9.38501535e-02
    9.38501535e-02
    9.38501535e-02
    9.38501535e-02
    1.05486873e-01
    1.05486873e-01
    1.05486873e-01
    1.16534822e-01
    1.16534822e-01
    1.16534822e-01
    1.26869325e-01
    1.26869325e-01
    1.26869325e-01
    1.26869325e-01
    1.36393435e-01
    1.36393435e-01
    1.36393435e-01
    0.00000000e+00
    0.00000000e+00
    1.77043123e-03
    6.61560991e-03
    6.61560991e-03
    1.38972678e-02
    1.38972678e-02
    2.30529076e-02
    2.30529076e-02
    3.35893673e-02
    3.35893673e-02
    3.35893673e-02
    4.50767974e-02
    4.50767974e-02
    4.50767974e-02
    5.71430300e-02
    5.71430300e-02
    5.71430300e-02
    6.94683219e-02
    6.94683219e-02
    6.94683219e-02
    8.17804515e-02
    8.17804515e-02
    8.17804515e-02
    9.38501535e-02
    9.38501535e-02
    9.38501535e-02
    9.38501535e-02
    1.05486873e-01
    1.05486873e-01
    1.05486873e-01
    1.16534822e-01
    1.16534822e-01
    1.16534822e-01
    1.26869325e-01
    1.26869325e-01
    1.26869325e-01
    1.26869325e-01
    1.36393435e-01
    1.36393435e-01
    1.36393435e-01
    0.00000000e+00
    0.00000000e+00
    1.77043123e-03
    6.61560991e-03
    6.61560991e-03
    1.38972678e-02
    1.38972678e-02
    2.30529076e-02
    2.30529076e-02
    3.35893673e-02
    3.35893673e-02
    3.35893673e-02
    4.50767974e-02
    4.50767974e-02
    4.50767974e-02
    5.71430300e-02
    5.71430300e-02
...
);

Y_H2O
(
    0.00000000e+00
    0.00000000e+00
    8.85215616e-04
    3.30780496e-03
    3.30780496e-03
    6.94863391e-03
    6.94863391e-03
    1.15264538e-02
    1.15264538e-02
    1.67946836e-02
    1.67946836e-02
    1.67946836e-02
    2.25383987e-02
    2.25383987e-02
    2.25383987e-02
    2.85715150e-02
    2.85715150e-02
    2.85715150e-02
    3.47341610e-02
    3.47341610e-02
    3.47341610e-02
    4.08902258e-02
    4.08902258e-02
    4.08902258e-02
    4.69250768e-02
    4.69250768e-02
    4.69250768e-02
    4.69250768e-02
    5.27434365e-02
    5.27434365e-02
    5.27434365e-02
    5.82674110e-02
    5.82674110e-02
    5.82674110e-02
    6.34346627e-02
    6.34346627e-02
    6.34346627e-02
    6.34346627e-02
    6.81967176e-02
    6.81967176e-02
    6.81967176e-02
    0.00000000e+00
    0.00000000e+00
    8.85215616e-04
    3.30780496e-03
    3.30780496e-03
    6.94863391e-03
    6.94863391e-03
    1.15264538e-02
    1.15264538e-02
    1.67946836e-02
    1.67946836e-02
    1.67946836e-02
    2.25383987e-02
    2.25383987e-02
    2.25383987e-02
    2.85715150e-02
    2.85715150e-02
    2.85715150e-02
    3.47341610e-02
    3.47341610e-02
    3.47341610e-02
    4.08902258e-02
    4.08902258e-02
    4.08902258e-02
    4.69250768e-02
    4.69250768e-02
    4.69250768e-02
    4.69250768e-02
    5.27434365e-02
    5.27434365e-02
    5.27434365e-02
    5.82674110e-02
    5.82674110e-02
    5.82674110e-02
    6.34346627e-02
    6.34346627e-02
    6.34346627e-02
    6.34346627e-02
    6.81967176e-02
    6.81967176e-02
    6.81967176e-02
    0.00000000e+00
    0.00000000e+00
    8.85215616e-04
    3.30780496e-03
    3.30780496e-03
    6.94863391e-03
    6.94863391e-03
    1.15264538e-02
    1.15264538e-02
    1.67946836e-02
    1.67946836e-02
    1.67946836e-02
    2.25383987e-02
    2.25383987e-02
    2.25383987e-02
    2.85715150e-02
    2.85715150e-02
...
);

Y_KERO
(
    0.00000000e+00
    0.00000000e+00
    8.37856539e-03
    1.66214115e-02
    1.66214115e-02
    2.46261652e-02
    2.46261652e-02
    3.23219660e-02
    3.23219660e-02
    3.96646101e-02
    3.96646101e-02
    3.96646101e-02
    4.66322019e-02
    4.66322019e-02
    4.66322019e-02
    5.32212716e-02
    5.32212716e-02
    5.32212716e-02
    5.94433253e-02
    5.94433253e-02
    5.94433253e-02
    6.53217918e-02
    6.53217918e-02
    6.53217918e-02
    7.08893342e-02
    7.08893342e-02
    7.08893342e-02
    7.08893342e-02
    7.61854958e-02
    7.61854958e-02
    7.61854958e-02
    8.12546517e-02
    8.12546517e-02
    8.12546517e-02
    8.61442405e-02
    8.61442405e-02
    8.61442405e-02
    8.61442405e-02
    9.09032480e-02
    9.09032480e-02
    9.09032480e-02
    0.00000000e+00
    0.00000000e+00
    8.37856539e-03
    1.66214115e-02
    1.66214115e-02
    2.46261652e-02
    2.46261652e-02
    3.23219660e-02
    3.23219660e-02
    3.96646101e-02
    3.96646101e-02
    3.96646101e-02
    4.66322019e-02
    4.66322019e-02
    4.66322019e-02
    5.32212716e-02
    5.32212716e-02
    5.32212716e-02
    5.94433253e-02
    5.94433253e-02
    5.94433253e-02
    6.53217918e-02
    6.53217918e-02
    6.53217918e-02
    7.08893342e-02
    7.08893342e-02
    7.08893342e-02
    7.08893342e-02
    7.61854958e-02
    7.61854958e-02
    7.61854958e-02
    8.12546517e-02
    8.12546517e-02
    8.12546517e-02
    8.61442405e-02
    8.61442405e-02
    8.61442405e-02
    8.61442405e-02
    9.09032480e-02
    9.09032480e-02
    9.09032480e-02
    0.00000000e+00
    0.00000000e+00
    8.37856539e-03
    1.66214115e-02
    1.66214115e-02
    2.46261652e-02
    2.46261652e-02
    3.23219660e-02
    3.23219660e-02
    3.96646101e-02
    3.96646101e-02
    3.96646101e-02
    4.66322019e-02
    4.66322019e-02
    4.66322019e-02
    5.32212716e-02
    5.32212716e-02
...
);

Y_N2
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

Y_O2
(
    1.00000000e+00
    1.00000000e+00
    9.88670716e-01
    9.72352572e-01
    9.72352572e-01
    9.52211722e-01
    9.52211722e-01
    9.29256521e-01
    9.29256521e-01
    9.04353111e-01
    9.04353111e-01
    9.04353111e-01
    8.78239802e-01
    8.78239802e-01
    8.78239802e-01
    8.51540345e-01
    8.51540345e-01
    8.51540345e-01
    8.24776138e-01
    8.24776138e-01
    8.24776138e-01
    7.98377456e-01
    7.98377456e-01
    7.98377456e-01
    7.72693743e-01
    7.72693743e-01
    7.72693743e-01
    7.72693743e-01
    7.48003049e-01
    7.48003049e-01
    7.48003049e-01
    7.24520645e-01
    7.24520645e-01
    7.24520645e-01
    7.02406884e-01
    7.02406884e-01
    7.02406884e-01
    7.02406884e-01
    6.81774360e-01
    6.81774360e-01
    6.81774360e-01
    1.00000000e+00
    1.00000000e+00
    9.88670716e-01
    9.72352572e-01
    9.72352572e-01
    9.52211722e-01
    9.52211722e-01
    9.29256521e-01
    9.29256521e-01
    9.04353111e-01
    9.04353111e-01
    9.04353111e-01
    8.78239802e-01
    8.78239802e-01
    8.78239802e-01
    8.51540345e-01
    8.51540345e-01
    8.51540345e-01
    8.24776138e-01
    8.24776138e-01
    8.24776138e-01
    7.98377456e-01
    7.98377456e-01
    7.98377456e-01
    7.72693743e-01
    7.72693743e-01
    7.72693743e-01
    7.72693743e-01
    7.48003049e-01
    7.48003049e-01
    7.48003049e-01
    7.24520645e-01
    7.24520645e-01
    7.24520645e-01
    7.02406884e-01
    7.02406884e-01
    7.02406884e-01
    7.02406884e-01
    6.81774360e-01
    6.81774360e-01
    6.81774360e-01
    1.00000000e+00
    1.00000000e+00
    9.88670716e-01
    9.72352572e-01
    9.72352572e-01
    9.52211722e-01
    9.52211722e-01
    9.29256521e-01
    9.29256521e-01
    9.04353111e-01
    9.04353111e-01
    9.04353111e-01
    8.78239802e-01
    8.78239802e-01
    8.78239802e-01
    8.51540345e-01
    8.51540345e-01
...
);

// ************************************************************************* //
