testCases/mixingChannel_fgmFluid_RAS/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }

simulationType  RAS;

RAS
{
    model           kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
