testCases/mixingChannel_fgmFluid_RAS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3900;
    }
    upperWall
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          100;
        startFace       3920;
    }
    lowerWall
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          100;
        startFace       4020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       4120;
    }
)

// ************************************************************************* //
