testCases/mixingChannel_fgmFluid_RAS/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }

solver          fgmFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5e-7;
deltaT          1e-8;
writeControl    timeStep;
writeInterval   50;
writeFormat     ascii;
writePrecision  10;
runTimeModifiable false;
adjustTimeStep  no;

libs ("libRGP13realFluid.so" "libfgmFluid.so");
